{
  "/1/": "Number of server slots.",
  "max_players": 24,
  "/2/": "The IP of your Assetto Corsa Server relative to the plugin. This is the IP that the plugin will use to contact the Assetto Corsa Server.",
  "ac_server_ip": "127.0.0.1",
  "/3/": "The HTTP Port of the Assetto Corsa server. This should match the Assetto Corsa server_cfg.ini HTTP_PORT setting (required for ping control).",
  "ac_server_http_port": 8081,
  "/4/": "The plugin port of the server as set in the server_cfg.ini (UDP_PLUGIN_LOCAL_PORT).",
  "ac_server_plugin_local_port": 8004,
  "/5/": "The port that the plugin will use (the portion after ':' in the UDP_PLUGIN_ADDRESS server_cfg.ini entry, if you set UDP_PLUGIN_ADDRESS=127.0.0.1:12000, set this to 12000).",
  "ac_server_plugin_address_port": 12000,
  "/6/": "How frequently should the Assetto Corsa send information about each car (lowering might increase CPU usage). 100 = 100ms.",
  "update_interval": 100,
  "/7/": "The maximum ping (in ms) a driver can have (the plugin will issue a warning if the instantaneous ping is over and kick the driver if the average is above the specified value for the last 4 measurements). Do not set this too low or it might affect server population. Set to 0 to disable the ping limit altogether.",
  "max_ping": 450,
  "/8/": "The maximum ping deviation (in ms) drivers can have before their connection is considered unstable (the plugin will kick the driver if the standard ping deviation is above the specified value for the last 4 measurements). This is a measure of the connection instability which is important for MP racing. Set to 0 to disable.",
  "max_ping_deviation": 100,
  "/9/": "The amount of seconds between two consecutive ping checks (decreasing this value might lead to high CPU usage). Set to 0 to disable the ping check feature altogether.",
  "ping_check_interval": 15,
  "/10/": "Stats Web Server Address (change this if you want to listen only on a certain interface, not recommended).",
  "web_stats_server_address": "0.0.0.0",
  "/11/": "Stats Web Server Port. For linux read the troubleshooting section of the readme.txt help file.",
  "web_stats_server_port": 80,
  "/12/": "Time to cache the stats in seconds (decreasing might increase CPU usage)",
  "web_stats_cache_time": 60,
  "/13/": "Stats Web Auth Address (change this if you want to listen only on a certain interface, not recommended).",
  "web_auth_server_address": "0.0.0.0",
  "/14/": "Stats Web Auth Port For linux don't use ports below 1024.",
  "web_auth_server_port": 12001,
  "/15/": "Time to cache the web auth result in seconds",
  "web_auth_cache_time": 60,
  "/16/": "Use this if you wish to also block users according to other plugins. Values are the same that you would set as the AUTH_PLUGIN_ADDRESS in the Assetto Corsa server_cfg.ini for the third-party plugin (e.g. for Minorating you would replace AUTH_PLUGIN_ADDRESS_1 with plugin.minorating.com:805/minodata/auth/ABCN/?).  You can of course also use another instance of the Kissmyrank Plugin Auth to get cross server blocking using the Kissmyrank AUTH_PLUGIN_ADDRESS from the other plugin instance. Check the console at the plugin start to see if the address is parsed correctly.",
  "web_auth_relay_to": [
    "AUTH_PLUGIN_ADDRESS_1",
    "AUTH_PLUGIN_ADDRESS_2",
    "AUTH_PLUGIN_ADDRESS_3"
  ],
  "/17/": "Use this if you wish to relay UDP traffic to other plugins (e.g. Minorating, Stracker. etc.). It works like this AC Server <-> Kissmyrank Plugin <-> Other plugins. For each plugin you need to specify the address in the  ip_address:port format (e.g. for a plugin running on 127.0.0.1 with port 12003, you would replace UDP_PLUGIN_ADDRESS_1 with 127.0.0.1:12003). In order for this to work you then need to set the other plugin like if the Kissmyrank Plugin was the Assetto Corsa Server (e.g. for the default Kissmyrank config that runs on port 12000, you would set the other plugin ac_server_plugin_port to 12000 and the ac_server_ip to the IP of the machine where you're running the Kissmyrank Plugin). Check the console at start to see if the address is parsed correctly.",
  "udp_relay_to": [
    "UDP_PLUGIN_ADDRESS_1",
    "UDP_PLUGIN_ADDRESS_2",
    "UDP_PLUGIN_ADDRESS_3"
  ],
  "/18/": "Path of the Assetto Corsa server_cfg.ini file to be used for track rotation. This must be the actual server_cfg.ini that acServer uses. The plugin will update this file and restart the server to rotate the track.",
  "ac_server_cfg_ini_path": "/home/steam/acserver/cfg/server_cfg.ini",
  "/19/": "Absolute Path of the Assetto Corsa Server executable to be used for track rotation (e.g. Windows c:/steam/acserver/acServer.exe, Linux /home/steam/acserver/acServer). The plugin will run this file to launch the Assetto Corsa server.",
  "ac_server_bin_path": "/home/steam/acserver/acServer",
  "/20/": "[Not Recommended!] Assetto Corsa Binary Launch Arguments for multiple servers like ['-c path_to_server_cfg.ini', '-e path_to_entry_list.ini'] (this might not work at all on some operating systems, for multiple servers please make copies of the server folder and run each instance separately).",
  "ac_server_bin_args": [],
  "/21/": "The path where you wish to save the Assetto Corsa Server logs.",
  "ac_server_log_path": "/home/steam/acserver/logs/",
  "/22/": "Comma separated list of tracks the server will rotate into. track is the id of the track as per the Assetto Corsa server_cfg.ini TRACK setting. config is the track layout as per the Assetto Corsa server_cfg.ini CONFIG_TRACK setting. Races is the number of full races that have to be completed before the server rotation occurs. ini_options is the additional server_cfg.ini entries that you would like to change when the track rotates. entry_list_ini_path allows you to change the entry_list.ini file when the track rotates (files that you specify will be copied over the existing entry_list.ini, do NOT use the Assetto Corsa default entry_list.ini path unless you want to keep the existing cfg). If you set this value, Kissmyrank Multiplayer Launcher Mod auto-rejoin will be disabled. This is in JSON format. See the readme for examples. Keep in mind that changes will stick. If you want to revert back on the next rotation you must change the value again.",
  "track_list": [
    {
      "track": "imola",
      "config": "",
      "races": 6,
      "entry_list_ini_path": "keep",
      "ini_options": {
        "PRACTICE": "remove",
        "QUALIFY": {
          "TIME": 10
        },
        "RACE": {
          "LAPS": 10
        }
      }
    },
    {
      "track": "monza",
      "config": "",
      "races": 6,
      "entry_list_ini_path": "keep",
      "ini_options": {
        "PRACTICE": "remove",
        "QUALIFY": {
          "TIME": 10
        },
        "RACE": {
          "LAPS": 10
        }
      }
    },
    {
      "track": "mugello",
      "config": "",
      "races": 6,
      "entry_list_ini_path": "keep",
      "ini_options": {
        "PRACTICE": "remove",
        "QUALIFY": {
          "TIME": 10
        },
        "RACE": {
          "LAPS": 10
        }
      }
    },
    {
      "track": "ks_silverstone",
      "config": "gp",
      "races": 6,
      "entry_list_ini_path": "keep",
      "ini_options": {
        "PRACTICE": "remove",
        "QUALIFY": {
          "TIME": 10
        },
        "RACE": {
          "LAPS": 10
        }
      }
    },
    {
      "track": "ks_vallelunga",
      "config": "extended_circuit",
      "races": 6,
      "entry_list_ini_path": "keep",
      "ini_options": {
        "PRACTICE": "remove",
        "QUALIFY": {
          "TIME": 10
        },
        "RACE": {
          "LAPS": 10
        }
      }
    },
    {
      "track": "spa",
      "config": "",
      "races": 6,
      "entry_list_ini_path": "keep",
      "ini_options": {
        "PRACTICE": "remove",
        "QUALIFY": {
          "TIME": 10
        },
        "RACE": {
          "LAPS": 10
        }
      }
    },
    {
      "track": "ks_laguna_seca",
      "config": "",
      "races": 6,
      "entry_list_ini_path": "keep",
      "ini_options": {
        "PRACTICE": "remove",
        "QUALIFY": {
          "TIME": 10
        },
        "RACE": {
          "LAPS": 10
        }
      }
    },
    {
      "track": "ks_nurburgring",
      "config": "layout_gp_a",
      "races": 6,
      "entry_list_ini_path": "keep",
      "ini_options": {
        "PRACTICE": "remove",
        "QUALIFY": {
          "TIME": 10
        },
        "RACE": {
          "LAPS": 10
        }
      }
    },
    {
      "track": "ks_barcelona",
      "config": "layout_gp",
      "races": 6,
      "entry_list_ini_path": "keep",
      "ini_options": {
        "PRACTICE": "remove",
        "QUALIFY": {
          "TIME": 10
        },
        "RACE": {
          "LAPS": 10
        }
      }
    }
  ],
  "/23/": "Do not rotate the track if more than the specified number of players is on the server (e.g. set this to 0 if you wish the rotation to occur the next time the server is empty, set it to 99 if you wish the rotation to occur at any time).",
  "track_rotation_max_players": 99,
  "/24/": "The symbol of the currency used for all drivers fines and payments (e.g. €,$,RUB).",
  "currency_symbol": "€",
  "/25/": "The symbol to be used to separate thousands (e.g. 19,000 or 19.000).",
  "thousand_separator": ",",
  "/26/": "Minimum amount of money (in thousands) a driver must have to stay on the server. 1 = 1000€ (e.g. -12 -> drivers with more than 12000€ of debt will be kicked). Please also check start_money in order to make sure that this value makes sense.",
  "min_money": 0,
  "/27/": "Minimum number of players required to race (must be >=2 if you're using the money system). If there are not enough players the server will skip the race session.",
  "race_min_players": 2,
  "/28/": "How much a driver has to pay to enter a race session on the server (in thousands). 0.3 = 300€ (e.g. drivers will be charged 300€ at the beginning of each race).",
  "race_driver_entry_fee": 0.3,
  "/29/": "How much a sponsor pays to get the driver into the race (in thousands). 1.5 = 1500€ (e.g. this, together with the race entry fee concurs to the total competition prize, the higher, the higher the race payouts).",
  "race_sponsor_entry_fee": 1.5,
  "/30/": "The amount of km required to pay the full sponsor fee (e.g. if the sponsor fee configuration is 1000€ and  you set this to 35, for a race of 7 laps on a 5km circuit sponsors will contribute 1000€ for each car, if the laps are 14 they will pay 2000€ for each car allowing for bigger prizes for longer races).",
  "race_sponsor_reward_base_length": 40,
  "/31/": "The amount of minutes required to pay the full sponsor fee (e.g. if the sponsor fee configuration is 1000€ and you set this to 15, for a race of 15 minutes sponsors will contribute 1000€ for each car, for 30 minutes they will pay 2000€ for each car allowing for bigger prizes for longer races).",
  "race_sponsor_reward_base_time": 15,
  "/32/": "How much sponsors will reward a driver that makes 5 clean overtakes during the race (in thousands). 1 = 1000€. Clean overtakes are positions gained without collisions excluding gains made on drivers that disconnect during the race.",
  "race_sponsor_clean_gain_reward": 1,
  "/33/": "How many clean overtakes are required for the sponsors to issue one clean gain reward (e.g. if you set this to 5 and the driver makes 5 clean overtakes he gets 1000€, if the overtakes are 10, he gets 2000€ etc.).",
  "race_sponsor_clean_gain_overtakes": 5,
  "/34/": "How much a driver will be paid for the fastest lap of the race (in thousands). 0.15 = 150€.",
  "race_fastest_lap_prize": 0.3,
  "/35/": "Laptime Challenge Base Prize (in thousands). 0.01 = 10€. Reward is base*level (level 2 gets 20). Set to 0 to disable the Laptime Challenge feature.",
  "laptime_challenge_base_prize": 0.01,
  "/36/": "Laptime Challenge Base Average Speed (km/h). 110=110km/h. A driver is Level 0 if he can drive a lap at 110 km/h average. Level 1 for 111 km/h and so on..",
  "laptime_challenge_base_average_speed": 110,
  "/37/": "The Average Speed Gap between two consecutive Laptime Challenge Levels in (km/h). 1=1km/h (e.g. Level 0 => 110km/h, Level 1 => 111km.",
  "laptime_challenge_level_average_speed_gap": 1,
  "/38/": "How much a driver will be paid for the fastest lap of all times  (in thousands). 1.5 = 1500€.",
  "alltime_fastest_lap_prize": 1.5,
  "/39/": "The cost (in thousands) of the damage of a collision between cars at the damage_cost_between_cars_base_speed. 3 = 3000€ (e.g. drivers will be charged 3000€ if they collide at the specified relative base speed). Please notice that damage goes with the square of the relative velocity.",
  "damage_cost_between_cars": 3,
  "/40/": "The cost (in thousands) of the damage of a collision with the environment at damage_cost_with_environment_base_speed. 3 = 3000€ (e.g. drivers will be charged 3000€ if they collide with the environment at the specified relative base speed). Please notice that damage goes with the square of the velocity.",
  "damage_cost_with_environment": 3,
  "/42/": "How far in meters should a car in the outlap get the 'Let the other car pass' warning when he's about to get passed.",
  "hotlap_protection": 45,
  "/43/": "How far in meters should a car that is being lapped get the 'Blue flag' warning when he's about to get passed.",
  "lapping_protection": 40,
  "/44/": "How far should a car in the outlap get the 'Let the other car pass' warning when he's about to get passed. Only used if track length is missing. 1 is the full track length (0.008 is 8/1000 of the full track length).",
  "relative_hotlap_protection": 0.008,
  "/45/": "How far should a car that is being lapped get the 'Blue flag' warning when he's about to get passed. Only used if track length is missing. 1 is the full track length (0.007 is 7/1000 of the full track length).",
  "relative_lapping_protection": 0.007,
  "/46/": "The time in seconds every car is given to make room since the first warning. Increase the warned_car_grace to give more time to a warned driver to let the other car pass. 12 = 12 seconds.",
  "warned_car_grace": 21,
  "/50/": "Maximum allowed leaderboard time as a fraction of the fastest time. 1.1 = 110% of the fastest time (e.g. a driver that is not able to set a time that is within 110% of the fastest lap time within minimum_driving_standard_laps laps will not be allowed in the server.",
  "minimum_driving_standard": 1.1,
  "/51/": "The amount of valid laps that a driver has to reach the minimum driving standard. A member is given a second chance after a few days according to minimum_driving_standard_recharge_period.",
  "minimum_driving_standard_laps": 12,
  "/52/": "The number of seconds to recharge one lap to a driver that doesn't meet the standards (e.g. if minimum_driving_standard_laps is set to 12, this value sets the amount of time a player with 13 laps and a poor time has to wait before he can join the server again).",
  "minimum_driving_standard_recharge_period": 86400,
  "/53/": "Number of players over which to enforce the minimum driving standards. If set to anything that is not 0, the driving standard policy will be enforced only if more than the specified number of players is present on server (not to kill the server population when the server is empty).",
  "minimum_driving_standard_min_players": 12,
  "/54/": "Car Towing Cost per Km. How much (in thousands) drivers will pay to tow their cars to the pits per Km. 0.05 = 50€ per Km (e.g. when he goes back to pits, a driver will pay 50€ for every km. Set to 0 to disable the feature altogether.",
  "car_towing_cost": 0.05,
  "/55/": "Enable cut lines. Set this to 0 if you wish to disable the cut_lines feature. Keep in mind that cut lines will only work if they are defined using the cut line drawer. To check the current cut lines, type cut_line_list in the console.. For more, please check readme.txt.",
  "cut_lines_enabled": 1,
  "/56/": "Session history length. How many sessions we should keep in the memory. Setting this to an higher value will use more memory.",
  "session_history_length": 30,
  "/57/": "The speed unit to be used when formatting data for public view. Allowed values are kmh and mph. Please note that this is only cosmetic for the end user and that you still need to use km/h for all the config purposes.",
  "speed_unit_format": "kmh",
  "/60/": "A list of the GUIDs for the drivers that have a reserved slot on the server (requires the Kissmyrank Multiplayer Launcher Mod). If the server is full and one of these GUIDs attempts to join, a player will be kicked to make room.",
  "reserved_slots_guid_list": [
    "guid1",
    "guid2",
    "guid3"
  ],
  "/61/": "The key that VIP players need to use in the Kissmyrank Multiplayer Launcher Mod to access their reserved slot. Drivers with a reserved slot need to type this key in the Kissmyrank Multiplayer Launcher Mod input box (near the red question mark button on top of the server list) before they can access their reserved slot. If this configuration entry is not set the reserved slots feature will be disabled altogether.",
  "reserved_slots_access_key": "",
  "/62/": "Whether to enable the memory monitor feature (on Linux it requires libc6 2.14+). Enable this if you wish the plugin to monitor the memory usage (good to troubleshoot problems that might be related to the memory allocation).",
  "memory_monitor_enabled": 0,
  "/63/": "Database Sharing Unique Name. Set a unique name for this plugin to better identify it in the logs. This is only cosmetic and completely optional.",
  "database_sharing_unique_name": "",
  "/64/": "Local Database Sharing Port for sharing the database with Kissmyrank instances running on the same machine. Set this to a valid port number If you wish to share the same database across different instances of the Kissmyrank plugin running on the same machine. You must set the port to the same value for all plugins that are members of the same sharing group (e.g. let's say that you have 4 Kissmyrank instances A,B,C,D and you want to use the same Kissmyrank database in couples with A sharing the same db with B and C and D sharing a separate one, you then set database_sharing_group_port config.json on KMR A and KMR B to 4567 and for KMR C and KMR D to 4568).",
  "database_sharing_local_group_port": 0,
  "/65/": "Remote Database Sharing Listen Port. Only use this if Local Database Sharing is not possible. Set this to a valid port number if you want to share the Database with a plugin running on a remote machine. Remote sharing might introduce lags so I recommend to use Local Database Sharing whenever it's possible.",
  "database_sharing_remote_listen_port": 0,
  "/66/": "Remote Database Sharing Secret Key. Only needed for remote sharing. This must be set to the same for all the hosts using Remote Database Sharing.",
  "database_sharing_remote_secret_key": "",
  "/67/": "Remote Database Sharing Listen Address (change this only if you want to listen only on a specific interface, not recommended).",
  "database_sharing_remote_listen_address": "0.0.0.0",
  "/68/": "Remote Database Sharing Connect to Addresses. The addresses of the remote plugins in the usual host:port format (where host is the IP/Address of the server that runs the plugin and port is the database_sharing_remote_listen_port that you set for that plugin). If you wish plugin A to share the database with the plugin B, you need to add hostA:portA to plugin B config.json and hostB:portB to plugin A config.json. For each plugin add all the ones that it should communicate with (excluding of course self or you'll start a loop). Don't connect two plugins with both local and remote sharing.",
  "database_sharing_remote_connect_to_addresses": [
    "kissmyrank_address_1",
    "kissmyrank_address_2",
    "kissmyrank_address_3"
  ],
  "/69/": "Remote Database Sharing Relay For Names. Warning: this key is not required for standard Database Sharing, it's only required if you have lonely plugins (e.g. plugins connected to one instance and not to the others). Let's say that you want to share the database between 3 plugins (A,B and C) and that you set database_sharing_unique_name to plugin_a, plugin_b, plugin_c respectively. Let's say that you can only connect A<->B and B<->C but you can't connect A with C directly. After properly setting all the other keys for (A<->B and B<->C), you then edit plugin_b config.json and add plugin_a and plugin_c to database_sharing_relay_for_names key. This will tell plugin B to relay information to the other plugin allowing you to do A<->B<->C. Keep in mind that in this case if you take down B, you have to also take down A and C or the synchronization might not fully apply. This feature works for both local and remote connections as long as you set the unique name. Be careful not to create double links between plugins or you might get double updates.",
  "database_sharing_relay_for_names": [
    "",
    "",
    ""
  ],
  "/70/": "Web Admin Console Password. The password (min 12 characters or the Kissmyrank Web Admin Interface will be forcefully disabled) that you will use to login to your Kissmyrank Web Admin Console at http://yourserver/kissmyrank_admin (when you open the page, if your password is 'yourcomplexpassword' you need to type 'login yourcomplexpassword' in order to gain access). Leave this key empty if you don't want to use the Kissmyrank Web Admin Console.",
  "web_admin_console_password": "",
  "/71/": "Path to a shell script or to a program to run after the plugin launches the Assetto Corsa Server (e.g track rotation). This can be used to automate the restart of other plugins or if you wish to perform some other task when the Assetto Corsa Server starts. This setting will only apply if the Kissmyrank Track Rotation Feature is enabled.",
  "after_ac_server_start_run_path": "",
  "/72/": "Whether to disable the Reserved Slots Player Booting feature during the race. Slots are freed per car starting from the bottom of the grid (so on a full grid it will most likely boot players that late joined or that are several laps down). You can set this to 1 if you wish to disable the reserved slot during the race session altogether. In this case, VIP players will have to wait for a slot to free up or for the next session.",
  "reserved_slots_boot_players_at_race": 1,
  "/73/": "The minimum amount of votes required to trigger a track change (in %). 60 = 60% of the drivers online must type kmr vote_track to initiate the track change to the most voted track. Set to 0 to disable track voting altogether.",
  "track_rotation_vote_min_percent": 60,
  "/74/": "The minimum absolute amount of votes required to initiate the track change. 4 = minimum 4 votes are required to change the track. Use this if you wish to prevent lonely players from changing the track.",
  "track_rotation_vote_min_votes": 4,
  "/75/": "The maximum amount of collisions per 100 km a driver is allowed on the server. This applies to drivers that have driven more than max_collisions__per_100km_min_distance.",
  "max_collisions_per_100km": 30,
  "/76/": "The driven distance (in km) over which the max_collisions_per_100km will start to apply.",
  "max_collisions_per_100km_min_distance": 100,
  "/77/": "The base time (hours per collision unit) a driver exceeding max_collisions_per_100km has to wait before he can rejoin the server (e.g. if max_collisions_per_100km is set to 30, a driver with 31 collision per 100km will have to wait 1h form the last time he left the server, if 32, he will have to wait 2 hours and so on)",
  "max_collisions_per_100km_recharge_hours": 6,
  "/78/": "The custom chat messages that you wish to deliver when a driver connects. One per line. You can add as many as you want.",
  "custom_chat_driver_welcome_messages": [
    "",
    "",
    "",
    ""
  ],
  "/79/": "The maximum distance in meters a driver is allowed to reverse on track (set to 0 to disable the penalty).",
  "reverse_gear_max_distance": 30,
  "/81/": "Path to a shell script or to a program to run before the plugin launches the Assetto Corsa Server (e.g track rotation). This can be used to automate tasks before the Assetto Corsa Server starts. Please notice that the Assetto Corsa Server will not be launched until this program terminates, so please use a shell script to launch programs that are required to run at the same time as the server (or use after_ac_server_start_run_path which is run after the server launch without further waiting). This setting will only apply if the Kissmyrank Track Rotation Feature is enabled.",
  "before_ac_server_start_run_path": "",
  "/82/": "The minimum damage cost (in thousands) under which collisions with the environment will not be logged. Set this to 0 to log all collisions. 0.001 = do not log collisions with the environment below 1€.",
  "collision_minimum_damage_with_environment": 0.001,
  "/83/": "The minimum damage cost (in thousands) under which collisions between cars will not be logged. Set this to 0 to log all collisions. 0.001 = do not log collisions with the environment below 1 euro.",
  "collision_minimum_damage_between_cars": 0.001,
  "/84/": "Web Stats Drivers per page. Sets how many drivers per page will show on the Web Stats Drivers list.",
  "web_stats_drivers_per_page": 600,
  "/88/": "The maximum speed (in km/h) at which a driver is allowed to cross the track boundary.",
  "track_boundary_cut_max_speed": 30,
  "/89/": "The maximum speed (in km/h) at which a driver is allowed to cross the track boundary after the first violation (this both applies to track re-entry and to further cuts).",
  "track_boundary_same_lap_cut_max_speed": 80,
  "/90/": "The length (in meters) of a single track boundary length (max recommended value is 3). Increase this if you wish to save disk space at the expense of accuracy. Please notice that this value only applies to new data sets.",
  "track_boundary_sample_length": 3,
  "/93/": "How much (in thousands) a driver will be paid for a clean lap (e.g. lap without any cut). You can use this on practice servers (since race rewards will not work there).",
  "clean_lap_reward": 0.05,
  "/94/": "Wether in a time based race the extra lap is enabled in the Assetto Corsa server_cfg.ini. If track rotation is active, the plugin will read the setting directly from the server_cfg.ini and ignore this value.",
  "time_based_race_extra_lap": 0,
  "/95/": "Wether to announce the first three at the end of the race.",
  "race_podium_announcement": 1,
  "/96/": "The password that Race Directors need to use to judge collisions via the Web Stats Page (needs to be at least 8 characters long or the feature will be disabled).",
  "race_control_password": "",
  "/98/": "Wether to enable the web stats interface (required for Race Control and Race Director collision moderation).",
  "web_stats_interface": 1,
  "/99/": "The maximum number of events that race control should display.",
  "race_control_max_events": 180,
  "/100/": "Set this to your server public Web Stats address if you wish to override the plugin public address autodetection.",
  "web_stats_override_public_address": "",
  "/101/": "Set this to your server public Web Stats port if you wish to override the default setting (e.g. in case of a forward, proxy, redirect etc.).",
  "web_stats_override_public_port": 0,
  "/102/": "Restarts the Assetto Corsa server if no activity is recorded for more than the specified amount of minutes (minimum 30 minutes, this setting only works if the track rotation is enabled). Please note that the new session packet is considered as valid server activity and will reset the counter.",
  "ac_server_restart_if_inactive_for_minutes": 90,
  "/103/": "Defines the maximum distance in meters between the two positions reported by the Assetto Corsa server for the same collision (to account for client-side discrepancies due to lag). Increase if collisions are reported twice.",
  "race_control_collision_space": 2.2,
  "/104/": "Defines the maximum amount of seconds that the Assetto Corsa server has to provide collision data for both cars. Increase if collisions are reported twice.",
  "race_control_collision_time": 9,
  "/105/": "Set this to 1 if you wish the plugin to log overtakes and add them to the Race Control viewer (this might use your memory and clutter the view to show events that are not strictly required for Race Control ).",
  "race_control_log_overtakes": 0,
  "/106/": "Set this to 1 if you wish the Web Stats Race Results viewer to include the lap log (which shows the times recorded for each player, the tyres he was on etc. on a per lap basis).",
  "web_stats_results_show_lap_log": 0,
  "/107/": "The money (in thousands) that any unranked player is given when he joins the server the first time (30=30000€). Please also check min_money in order to make sure that this value makes sense.",
  "start_money": 30.000,
  "/108/": "The money penalties (in thousands) that you would like to give for any given situation.",
  "penalty_cost_map": {
    "hotlap_protection": {
      "practice": 0.1,
      "qualify": 0.6
    },
    "hotlapping_car_collision": {
      "practice": 0.1,
      "qualify": 0.6
    },
    "lapping_protection": {
      "race": 0
    },
    "lapping_car_collision": {
      "race": 0.6
    },
    "reverse_gear": {
      "practice": 0.1,
      "qualify": 0.6,
      "race": 0.6
    },
    "track_boundary_cut": {
      "other": 0,
      "practice": 0,
      "qualify": 0.1,
      "race": 0.05
    },
    "track_rejoin_max_speed": {
      "other": 0,
      "practice": 0,
      "qualify": 0.1,
      "race": 0.1
    },
    "max_infractions": {
      "qualify": 0.6
    },
    "max_collisions": {
      "practice": 0.3,
      "qualify": 0.6,
      "race": 0.6
    },
    "first_blood": {
      "race": 0.6
    },
    "pit_lane_speeding": {
      "qualify": 0.3,
      "race": 0.6
    },
    "pit_exit_line_crossing": {
      "practice": 0.3,
      "qualify": 0.6,
      "race": 0.6
    },
    "cut_line_your_custom_cut_line": {},
    "anticheat_max_clock_delta_consecutive_hits": {},
    "speeding_under_vsc": {},
    "slowing_under_vsc": {},
    "overtaking_under_vsc": {},
    "improving_qualify_laptime_with_infractions": {
      "qualify": 0
    },
    "parking_near_track": {
      "practice": 0.3,
      "qualify": 0.6,
      "race": 0.6
    }
  },
  "/109/": "The penalties that you would like to give for any situation. DT0 for a drive through before the end of the lap. DT1 for a drive through before the end of the following lap and so on. DT given during qualify and practice will have to be cleared during the following race. K to kick immediately. TB30 to issue a temporary ban for 30 minutes. TB60 to issue a temporary ban for 60 minutes.",
  "penalty_action_map": {
    "hotlap_protection": {},
    "lapping_protection": {
      "race": "DT1"
    },
    "reverse_gear": {},
    "track_boundary_cut": {},
    "track_rejoin_max_speed": {},
    "max_infractions": {
      "race": "DT1"
    },
    "max_collisions": {
      "practice": "K",
      "qualify": "K",
      "race": "K"
    },
    "first_blood": {},
    "pit_lane_speeding": {},
    "pit_exit_line_crossing": {},
    "cut_line_your_custom_cut_line": {},
    "anticheat_max_clock_delta_consecutive_hits": {
      "practice": "K",
      "qualify": "K",
      "race": "K"
    },
    "speeding_under_vsc": {
      "race": "K"
    },
    "slowing_under_vsc": {
      "race": "K"
    },
    "overtaking_under_vsc": {
      "race": "K"
    },
    "improving_qualify_laptime_with_infractions": {
      "qualify": ""
    },
    "parking_near_track": {
      "practice": "K",
      "qualify": "K",
      "race": "K"
    }
  },
  "/110/": "Set this to 1 if you wish to use points instead of money (no money, no party :D).",
  "no_money": 0,
  "/111/": "The maximum number of times a driver is allowed to violate the server rules (cut track, speeding, pit exit line crossing etc.) before receiving the penalties set in the penalty_cost and penalty_action maps.",
  "max_infractions": 6,
  "/112/": "A list of the GUIDs for the drivers that can send Kissmyrank Admin Commands via the Assetto Corsa Chat (type '/kmr login password' in the chat to login and '/kmr command' to launch one of the supported commands).",
  "ac_chat_admin_guid_list": [
    "guid1",
    "guid2",
    "guid3"
  ],
  "/113/": "The admin password to be used to login from the Assetto Corsa chat (type '/kmr login password' in the game chat to login).",
  "ac_chat_admin_password": "",
  "/114/": "Defines the amount of seconds that the plugin should show for each car in the Race Control Collsion Replay.",
  "race_control_collision_replay_time": 6,
  "/115/": "Defines the amount of seconds that the plugin should show for each car in the Race Control Cut Replay.",
  "race_control_cut_replay_time": 6,
  "/116/": "Defines the amount of seconds that the plugin should show for each car in the Race Control Overtake Replay.",
  "race_control_overtake_replay_time": 6,
  "/117/": "The maximum number of collision any user can be involved before receiving the penalties set in the penalty_cost and penalty_action maps.",
  "max_collisions": 6,
  "/118/": "The maximum speed at which a driver is allowed to rejoin the track after going off track in an excluded area or stopping the car outside the track.",
  "track_rejoin_max_speed": 120,
  "/119/": "Cars within this distance (in meters) from the car originating the Race Control Event will be included in the replay. 100 = 100m (e.g. if a car collides with another, all the drivers within 100 meters will be included in the replay).",
  "race_control_include_players_nearer_than": 100,
  "/120/": "The maximum time (in seconds) between the cut start and the cut end (cuts outside this range will be regarded as out-of-track moments).",
  "track_boundary_cut_max_time": 9,
  "/121/": "The base speed (in km/h) for damage_cost_between_cars.",
  "damage_cost_between_cars_base_speed": 100,
  "/122/": "The base speed (in km/h) for damage_cost_with_environment.",
  "damage_cost_with_environment_base_speed": 100,
  "/123/": "Wether to enable the Track Boundary Cut Gain filter which compares the cut advantage against the fastest lap of the session and doesn't give the penalty if the driver loses time against it.",
  "track_boundary_cut_gain_filter": 1,
  "/124/": "The minimum acceptable time loss (in percent) for the Track Boundary Cut Gain filter to ignore the cut. 6=6% (e.g. a driving losing more than 6% compared to the fastest laptime of the session will not incour in a penalty).",
  "track_boundary_cut_gain_filter_min_loss_percent": 6,
  "/125/": "This speed (expressed in km/h) sets the floor speed of the Track Boundary Cut Gain filter. 45 = 45km/h (e.g. if a player during the cut wastes more time than traveling the interested track section at 45km/h the cut will be diregarded). This is only useful in the first laps when the comparison lap has not been acquired yet.",
  "track_boundary_cut_gain_filter_min_average_speed": 45,
  "/126/": "Sort rank by winning stats instead of money. If you change this you have to reset the database.",
  "rank_sort_by_win_stats": 0,
  "/127/": "Set this to 1 if, just like Captain Jean-Luc Picard, you do not want to use the money/point system at all (e.g. leagues, private servers and all people that are only interested in Kissmyrank Race Control and Tracking features). If you change this, you have to reset the database (e.g. perform a fresh install of the plugin).",
  "jlp_money_kill_switch": 0,
  "/128/": "How much (in thousands) should the first three drivers be rewarded, if more than the specified amount of players posted a valid qualify time. 0.5 = 500€ (e.g. first gets 1500, second gets 1000, third gets 500€).",
  "qualify_top_three_base_prize": 0.5,
  "/129/": "How many players need to post a time before the pole prizes are assigned.",
  "qualify_top_three_prize_min_players": 9,
  "/130/": "The pit speed limit (in km/h). Above this speed the drive-through will be aborted. 80 = 80km/h (you might want to use 81 if you face the speed limiter bug). This value is required, please do not set to 0.",
  "pit_speed_limit": 80,
  "/131/": "The minimum time (in second) between two consecutive cutting penalties (boundaries and cut lines). 6 = 6s (e.g. if a driver cuts twice in less than 6s he will be only penalized once). Do not lower this too much to avoid penalty spam.",
  "driving_line_penalty_repeat_grace": 3,
  "/132/": "This is the parent of the Assetto Corsa results folder (e.g. this entry should be normally set to the Assetto Corsa Server Root Folder path). If you already set ac_server_bin_path, you can leave this empty as the plugin will detect the base path automatically. Use this only if you wisth to force a specific base path for the results (e.g. if you don't use the track rotation but you still want to collect the results for Web View).",
  "ac_server_results_base_path": "",
  "/133/": "The maximum difference (in milliseconds) between the laptimes reported by the Assetto Corsa Server and those measured by the Plugin (with the hosting machine clock) before a laptime is rejected (e.g. to prevent the abuse where one can manipulate Assetto Corsa laptimes by acting on the CPU clock). Please keep in mind that this value needs to account for the natural delays in the communication between the plugin and the server. Do not set it too low or it might penalize drivers when your server is under stress. Use it only if your server has enough resources to process packets with steady delays. Set to 0 to disable.",
  "anticheat_laptime_invalidate_max_clock_delta": 1000,
  "/134/": "The number of consecutive times a driver has to hit the max_clock_delta before getting the penalty defined in the penalty cost and penalty action maps. Set to 0 to disable.",
  "anticheat_penalize_driver_max_clock_delta_consecutive_hits": 3,
  "/135/": "If you wish to use Kissmyrank Rolling Start at race.",
  "rolling_start": 0,
  "/137/": "The amount of seconds a driver is allowed to speed over the speed limit during a Virtual Safety Car or the Rolling Start Formation Lap.",
  "vsc_speeding_max_grace": 3,
  "/138/": "The amount of seconds a driver is allowed to slow down under the minimum speed during the Rolling Start Formation Lap.",
  "vsc_slowing_max_grace": 9,
  "/139/": "The maximum speed (in km/h) a player is allowed to drive during a Virtual Safety Car.",
  "vsc_default_speed_limit": 120,
  "/140/": "The amount of seconds a driver has to give the position back when overtaking another car during a Virtual Safety Car or the Rolling Start Formation Lap.",
  "vsc_overtaking_max_grace": 12,
  "/141/": "The maximum speed (in km/h) a player is allowed to drive during the Rolling Start Formation Lap.",
  "vsc_formation_lap_speed_limit": 150,
  "/142/": "The min speed (in km/h) a driver must observe during the Rolling Start Formation Lap (set to 0 to disable).",
  "vsc_formation_lap_min_speed": 30,
  "/143/": "This sets the speed in km/h under which the leader can be overtaken during Virtual Safety Car or the Rolling Start Formation Lap (e.g. not allowing a parked car to block everyone).",
  "vsc_default_leader_slow_allow_overtake_speed": 30,
  "/144/": "This sets the speed in km/h under which a driver can be overtaken during the Virtual Safety Car or the Rolling Start Formation Lap if he's farther than vsc_defalut_slow_and_far_allow_overtake_distance.",
  "vsc_default_slow_and_far_allow_overtake_speed": 40,
  "/145/": "This sets the distance from the previous car over which a driver can be overtaken during the Virtual Safety Car or the Rolling Start Formation Lap if he's slower than vsc_defalut_slow_and_far_allow_overtake_speed.",
  "vsc_default_slow_and_far_allow_overtake_distance": 75,
  "/146/": "This sets the distance from the previous car over which a driver can be overtaken during the Rolling Start Formation Lap (as during the formation lap cars need to be near to each other).",
  "vsc_formation_lap_far_allow_overtake_distance": 100,
  "/147/": "How many infractions you would like to add to the infraction counter for each penalty during each session.",
  "penalty_infraction_map": {
    "hotlap_protection": {},
    "hotlapping_car_collision": {},
    "lapping_protection": {},
    "lapping_car_collision": {},
    "reverse_gear": {},
    "track_boundary_cut": {
      "practice": 1,
      "qualify": 1,
      "race": 1
    },
    "track_rejoin_max_speed": {
      "practice": 1,
      "qualify": 1,
      "race": 1
    },
    "max_infractions": {},
    "max_collisions": {},
    "first_blood": {},
    "pit_lane_speeding": {
      "practice": 1,
      "qualify": 1,
      "race": 1
    },
    "pit_exit_line_crossing": {
      "practice": 1,
      "qualify": 1,
      "race": 1
    },
    "cut_line_your_custom_cut_line": {
      "practice": 1,
      "qualify": 1,
      "race": 1
    },
    "anticheat_max_clock_delta_consecutive_hits": {},
    "speeding_under_vsc": {},
    "slowing_under_vsc": {},
    "overtaking_under_vsc": {},
    "improving_qualify_laptime_with_infractions": {
      "qualify": 0
    },
    "parking_near_track": {}
  },
  "/148/": "The percentage of players that have to be involved in a collision within the specified mass_accident_crash_time before the plugin triggers the mass accident response (e.g. Virtual Safety Car or Automatic-Restart). 45 = 45%.",
  "race_mass_accident_crashed_players_percentage": 45,
  "/149/": "The time in seconds over which to evaluate race_mass_accident_crashed_players_percentage. 30 = 30s.",
  "race_mass_accident_crash_time": 30,
  "/150/": "The minimum number of players that have to crash for the mass accident response (e.g. to prevent the Virtual Safety Car coming out too often in servers with few players).",
  "race_mass_accident_min_crashed_players": 4,
  "/151/": "What to do when a mass accident occurs. Use VSC# where # = seconds for the Virtual Safety Car (e.g. VSC60 for 60 seconds) and AR for the automatic race restart. Leave empty to disable.",
  "race_mass_accident_response": {
    "first_lap": "VSC60",
    "other_laps": "VSC60"
  },
  "/152/": "Whether to enable the Live Track View (e.g. set to 0 if you wish to disable the Web Stats Live Map option).",
  "live_track_view": 1,
  "/153/": "The UDP port to be used to relay Kissmyrank events to compatible Assetto Corsa Game Apps (set to 0 to disable this feature). AC apps might connect to this port. Full documentation is available under /applink/doc. Demo app available under /applink/demo/.",
  "ac_app_link_udp_port": 12002,
  "/154/": "Whether to show the Race Control link when a driver joins.",
  "chat_driver_welcome_message_show_race_control_link": 1,
  "/155/": "The laptime (in percent of the session best) over which an improved time with cuts will not be considered an abuse. 107 = 107% (e.g. a driver posting a time with Kissmyrank infractions but no AC infractions that is above 107% of the fastest lap of the session will not trigger the penalty).",
  "improving_qualify_laptime_with_infractions_cutoff_percent": 107,
  "/156/": "Set this password to at least 8 characters if you wish to give view-only access to the Web Admin console. Please keep in mind that entry #70 needs to be set to activate the console in first place. Furthermore please only give this password to trusted member as they will see everything that appears in the Kissmyrank console.",
  "web_admin_console_guest_password": "",
  "/157/": "The amount of times a driver can trigger the parked car detection before he gets a penalty. 4 = 4 times (set to 0 to disable this detection).",
  "parked_car_max_grace": 4,
  "/158/": "The amount of seconds for the car parked detection. 6 = 6s (e.g. a driver that is near the track and doesn't move more than the parked_car_distance in 6s will trigger the detection once).",
  "parked_car_seconds": 6,
  "/159/": "The distance (in meters) a car must travel in parked_car_max_seconds not to trigger the detection. 24 = 24 meters (a car on the track that moves more than 24 meters in parked_car_seconds will not trigger the detection).",
  "parked_car_distance": 24,
  "/160/": "Whether to enable the 'kmr erase_personal_data_and_ban_myself' chat command which allows drivers to make use of their right to be forgotten and get all of their stats removed.",
  "right_to_be_forgotten_chat_command": 0,
  "/161/": "Whether to disable kick penalty when a DT is not cleared or when two DT events occur in a row.",
  "drive_through_no_kick": 0
}